##############################
#        其他常見語法         #
##############################

# cp1：in、not in
# 用途：串列裡是否有/沒有某個元素
# 基本寫法：
# 1. <某元素> in <某串列>
# 2. <某元素> not in <某串列>
list_ex1 = [1, 2, 3, 4, 5, 6, 7]
print(f"cp1. 串列裡有3 {3 in list_ex1}")
print(f"cp1. 串列裡有8 {8 in list_ex1}")
print(f"cp1. 串列裡沒有8 {8 not in list_ex1}")


# cp2：加號"+"
# 用途：利用加號"+"合併多個串列
# 基本寫法：list1+list2
list_ex2 = [2, 2, 2, 2, 2, 2, 2]
list_ex3 = [3, 3]
list_ex4 = [4]
list_ex5 = list_ex2 + list_ex3 + list_ex4
print(f"cp2. 合併後的結果為：{list_ex5}")


# cp3：乘號"*"
# 用途：複製串列
# 基本寫法：list_example * <要複製幾份>
list_ex6 = [1, 2, 3]
list_ex7 = list_ex6 * 1
list_ex8 = list_ex6 * 3
print(f"cp3. 複製一份：{list_ex7}")
print(f"cp3. 複製多份：{list_ex8}")

### 特別注意 ###
# 使用乘號去複製的串列，是"淺拷貝"!!!!
# 改了某一個增生的串列，其他串列會一起同步
# 想要深拷貝要用for迴圈
# 範例：
list_ex9 = [[0] * 3] * 3
# 會得到：[[0, 0, 0], [0, 0, 0], [0, 0, 0]]

list_ex9[0][0] = 1
# 會得到：[[1, 0, 0], [1, 0, 0], [1, 0, 0]] # 子串列的第一個索引值都一起被改
