####################################################################################################
#  語法練習：函式
#  講義來源：https://docs.google.com/document/d/1IdFIbR6MfRiY2Hcr0R9VM1uK8cnONpqE/edit?usp=sharing&ouid=113073999793927873424&rtpof=true&sd=true
####################################################################################################


# 共用程式碼
##################################################
import re


# 判斷是否為正整數
def isPositiveInt(str):
    return re.fullmatch(r"[1-9]\d*", str) is not None


# 題目
##################################################
# ### 題目一 ###
